[
    {
        "name": "Fields Institute for Research in Mathematical Sciences",
        "position": "Teaching Instructor",
        "description": "I have been a paid outreach instructor at the Fields Institute and the Department of Mathematics, which have a joint outreach department. I've led three workshops, being in complete creative control over both their planning and execution. Two of them have been \"enrichment\" workshops (one in logic in computer science, and the other in cryptography), aimed at students looking for greater challenges and stimulation in mathematics beyond the ordinary curriculum. These workshops span 3-6 hours over five consecutive days. I recently concluded a five-week contest workshop, aimed at developing strong problem-solving habits and skills.  Prior to this, I volunteered with the Fields Institute teaching a hands-on workshop in topology.",
        "start": "February 2023",
        "end": "Present"
    },
    {
        "name": "Blitz Notes",
        "position": "Co-Founder",
        "description": "In 10th grade, I received requests from my peers  to send them my notes from an English language seminar. Instead of responding individually, I scraped 150 email addresses from the school directory, set up a GitHub Pages repository with the file on it, created a rudimentary website, and sent it to everybody on a grade-wide email chain.      This was the first time anyone had begun an intra-grade conversation on this level. Soon, the chain blossomed into activity, and others began to contribute en masse.      A few months later, my friend Rishi and I then decided to design my own notes sharing repository, Blitz Notes.      While Rishi worked on the front-end, I built a back-end server and programmed an automatic integration with a notes editor. Together, we designed an easy-to-use workflow for writing and publishing notes. After a month’s programming and debugging, Blitz Notes, upon release in February 2020, quickly evolved into a massive undertaking. We assigned subject leads and assembled a team of over 30 people in creating up-to-date notes. We are a well-known IB/IGCSE resource. As of July 3rd 2021, we had <strong>143,093 pageviews</strong> from <strong>39,928 regular users</strong> across <strong>148 countries</strong>. We have over <strong>350 webpages</strong> of notes within the site.      ",
        "link": "https://www.blitznotes.org/",
        "start": "April 2018",
        "end": "Present"
    },
    {
        "name": "Computational Thinking Club",
        "position": "Founder and President",    
        "description": "With a team of 5 organisers, I helped brainstorm and devise a rigorous curriculum in mathematics and computer science, holding weekly lessons. I led the team in teaching programming and algorithms to 30+ members from grades 7-12. We also ran an online, open-source data science course, teaching skills in data visualization and analysis using programming to IB and IGCSE students. All the material for the course is available on BlitzNotes in the attached link.       ",
        "link": "https://www.blitznotes.org/datascience/",
        "start": "August 2019",
        "end": "March 2021"
    },
    {
        "name": "VIVUM 2020",
        "position": "Event Coordinator for Technology, Registration, and Streaming",
        "description": "Coordinated and led the heads of technology, registration, and streaming in successfully shifting a city-wide cultural fest, VIVUM 2020, to an online platform during the pandemic. To be honest, I'm filling in details about this in university, and I don't remember some of the statistics. I could look it up, but why bother? I'm pretty sure we invited over 20 schools, and we had around 1000 concurrent viewers consistently over 7 days. We raised a lot of money for wildlife conservation. This was honestly really fun -- I got to learn a lot about streaming and video production, and I got to work with a lot of really cool people!",
        "start": "May 2020",
        "end": "August 2020"
    }
]