"[{\"type\":\"project\",\"name\":\"Pentalink\",\"position\":\"Creative Director, Lead Programmer, and Game Developer\",\"shortdescription\":\"Worked with and led creative team; engineered state-system, levels, graphics, al gorithms, AI, UI/UX elements; used academic reference; 500+ downloads.\",\"description\":\"I worked with and led Pentalink's creative team - I was the sole game programmer on this project. Its inception was the product of bored experimentation during a free lesson, and has now evolved into an epic strategic battle of minds, ubiquitously played amongst our close circle of friends during lunch breaks and bus journeys. Using multiple game design concepts such as state stacks, 2D maps, procedural level generation, and GUI design, I programmed the game from scratch in the Lua programming language using LÖVE2D as a game engine and framework. A notable problem I encountered was the detection of face cycles in planar graphs, a topic I researched deeply for the project.\",\"start\":\"September 2019\",\"end\":\"December 2019\",\"link\":\"https://pentalink.github.io/\"},{\"type\":\"projects\",\"name\":\"Project Euler\",\"shortdescription\":\"Solved 100+ problems, achieved top 1% award; researched computational number theory; developed own numerical Python library; verified OEIS archive.\",\"description\":\"Solved over 109 problems on Project Euler, programming my own solutions and creating a Python3 library for computatational number theory algorithms. Researched topics in mathematics and computer science in the process. Made all solutions as well as the library open-source on my GitHub page - the library is named 'addmath.py', reminiscently after the IGCSE Additional Mathematics course I wrote exams for in Grade 10. I also earned the top 1% badge on the platform. Members of the website who solve more than 109 problems fall in the top 1% of problem solvers, earning the award as a badge. The answers are integer solutions to mathematics problems which require skills in programming and algorithms to solve. I also created a Discord bot that serves as a wrapper for the library for access within text channels on Discord servers.\",\"start\":\"January 2017\",\"end\":null,\"link\":\"https://projecteuler.net/\"},{\"type\":\"fun\",\"name\":\"ECHO (Experimental Counterfeiter of Human Occupancy)\",\"shortdescription\":\"\",\"description\":\"<p>\\n            This quarantine, I built my own computer. I had spent months researching a specific graphics processing unit that I wanted – a raytracing card with tensor cores. Sure, I wanted it to play video games at ultra-settings, to run research simulations, and to edit videos. There was, however, another crucial reason I was excited: I could now take my online class shenanigans to the next level.<br/><br/>\\n            The day I got it, I launched Open Broadcasting Software and got to work. I started rendering videos of myself sitting in my chair, shifting around, revolving, staring at the ceiling, and perhaps taking a little scribble here and there. Loop it back. Render another. Then, the phrases: I'd record multiple variations of myself going \\\"Yes, I understand\\\", “Absolutely”, “No, I don’t think I have any doubts for now”. I recorded myself in tens of different ponderous gazes, understanding nods, and reflective head movements of clear affirmation. “That’s right; I’ll get to work on that right away”.<br/><br/>\\n            Soon, I had an entire video library of all possible generic reactions and idle resting positions. Next, I programmed a script that automatically logged into my classes on time.<br/><br/>\\n            I named it the Experimental Counterfeiter of Human Occupancy (or ECHO for short). With ECHO, I was finally ready to automate my presence in online class.<br/><br/>\\n            I had never looked forward to an online Monday morning this much. I left ECHO running overnight and sat down at my system the next morning. I watched it login into my morning class at 7:45, greet the class entirely out of context, and proceed to simulate an unnaturally diligent Vishnu staring with focus at his desktop monitor.<br/><br/>\\n            It didn’t take me long to realize, sitting in my chair with my celebratory bowl of cereal, that I was being counterproductive. Every time I was prompted to say something, I had to assist ECHO in choosing the correct responses.<br/><br/>\\n            Without making novel discoveries in the science of computational intelligence, the road pretty much ended here. Yes, it worked, but it was hilariously useless. Sorry ECHO – if you’re actually sentient and you’re reading this, I’m immensely proud of you. Whether you do it well or not, I’m sure you (or a hyper-evolved version) will continue fulfilling your raison d'etre of pretending to be Vishnu for generations to follow.\\n\\n        </p>\",\"start\":\"September 2020\",\"end\":null},{\"type\":\"project\",\"name\":\"Can I Have Water?\",\"position\":\"Programmer\",\"link\":\"https://github.com/nitvishn/water/\",\"shortdescription\":null,\"description\":\"In Bangalore, a large part of the water supply network uses tankers for transportation. There are a few problems with this system. Suppliers don’t have accurate data for their customers’ water needs, there is a rampant inequality in water distribution, and the tankers don't have a system to decide routes. After conducting researching the water consumption needs of households within Bangalore, we built a model that uses sinusoidal regression to predict future water consumption. We identified redundant resources within tanker networks and optimised routes, resulting in a fewer number of tankers needed to be used, and a higher number of communities fulfilled per tanker. We also built a client side interface for households and communities to register themselves and track their water usage. The algorithms that ran in the backend are on the linked repository.\",\"start\":\"January 2020\"},{\"type\":\"project\",\"name\":\"GreenWheels\",\"position\":\"Lead Programmer and Project Director\",\"link\":\"https://github.com/nitvishn/CarPooling/\",\"shortdescription\":null,\"description\":\"Designed a carpooling system to be used amongst members of residential communities in Bangalore. I solved the travelling salesman problem using a greedy approach, and built an algorithm that optimises carpooling groups taking into account parameters such as schedule, social preferences, car size, and more.\",\"start\":\"January 2018\"},{\"type\":\"programming\",\"name\":\"Pong, but the paddles move in 2 dimensions\",\"link\":\"https://github.com/nitvishn/pong/\",\"description\":\"It's local multiplayer pong, but you can use WASD and arrow keys to move each paddle around in two dimensions. They also teleport when they cross boundaries. It's a very simple change to a classic game, but tt's really, really fun. We played it a lot in dorm, and I was most definitely the best. Probably because I spent so many hours iteratively programming the game, testing it, challenging my friends to duels, losing, and then tweaking the code so that I had an edge the next time. Fun. Interesting.\",\"start\":\"August 2019\"},{\"type\":\"programming\",\"name\":\"Connect 4 Bot\",\"link\":\"https://connect4-nitvishn.herokuapp.com/\",\"description\":\"I mean, it's a bot that plays connect4. Self-explanatory. This was during a really intense connect4 craze at our school - everyone was playing connect4 on paper notebooks in between and during classes. There was a very clear dominance heirarchy, and although I wasn't terrible, I wasn't at the top. This bot was. Consistently. So good luck :\",\"start\":\"April 2017\"},{\"type\":\"programming\",\"name\":\"Economics Graph Generator\",\"shortdescription\":\"A bug-riddled automatic graph generator to illustrate concepts within Microeconomics, Macroeconomics, and International Economics such as the Keynesian aggregate supply curve, exchange rate markets, and diagrams for displaying the market effects of government regulations. \",\"start\":\"June 2020\"},{\"type\":\"programming\",\"name\":\"Charged Particle Simulator\",\"link\":\"https://nitvishn.github.io/electro/\",\"description\":\"A simulation of physical interactions between charged particles. The simulation works relatively well in terms of the forces between the particles, but partly breaks down when they collide. Psst: if you really want to see it in action, move your mouse around and press the 'p' and 'n' buttons to spawn negative and positive particles. Have fun :\",\"start\":\"February 2018\"},{\"type\":\"fun\",\"name\":\"Vigenere and Subtitution Cipher Cracking Tool\",\"description\":\"A tool that helps crack vigenere and substitution ciphers quickly. \",\"link\":\"https://github.com/nitvishn/crypto\",\"start\":\"August 2016\"},{\"type\":\"fun\",\"name\":\"FlowerSpirals\",\"link\":\"https://nitvishn.github.io/flowerspirals/\",\"description\":\"A visual tool to illustrate the beautiful mathematics behind the layout of seeds in sunflowers - each dot representing a seed is drawn at a certain angle from the previous one, forming a spiral. This angle is initialised (the first textbox in the webpage and incremented a little each frame (the second textbox in the webpage). Try putting the golden ratio into the the first box and reload with the changes! Note: please use very small numbers for the second box - a good value to end use is 0.00001.\",\"start\":\"February 2018\"},{\"type\":\"fun\",\"name\":\"Fish Genetics\",\"link\":\"https://github.com/nitvishn/genetics1\",\"description\":\"When our class was doing a Genetics and Environmental Science worksheet, I strangely realised that the test was not completely fair. When we were drawing toothpicks of a particular colour from the gene pool, we were increasing the probability of the other genes to be chosen, therefore rendering the experiment not truly random. When we humans sort the toothpicks and choose \\\"randomly\\\", it was actually not that random, partially because of human error, and the reason I stated above. Also, there were only 24 genes in the gene pool, and we made just 4 generations from them. I decided to write some code, and run a computer simulation.\\n\\n        I made sure that the genes were randomly chosen, and I ran it for 2400 genes, while making 100 generations. I averaged the results over 100 trials. I generated a few figures as a result, revealing some interesting insights.\\n        \",\"start\":\"April 2017\"},{\"type\":\"fun\",\"name\":\"Optimal Roommate Allocator\",\"link\":\"https://github.com/nitvishn/roommate\",\"description\":\"A program that generates sets of roommates based on a preferential selection system. The algorithm used is pretty close to brute force, and I'm sure there's a way to improve it much further.\",\"start\":\"December 2018\"},{\"type\":\"fun\",\"name\":\"hangman\",\"link\":\"https://github.com/nitvishn/hangman\",\"description\":\"In English class, our teacher let us play Hangman to pass the time - I'm pretty sure we had earned it in some way or another. I was really bad. I wrote this. It's a very cruel way to treat the people you're playing with - a dictionary search is a loser's way to play the game. Either way, I won a lot.\",\"start\":\"January 2018\"},{\"type\":\"fun\",\"name\":\"Two Player Snake\",\"link\":\"https://nitvishn.github.io/Snake2p/\",\"description\":\"The Snake game, but now with two players. God, I have so many more of these, but I think this one is the most charismatic. It's very buggy - when we used to play this in my school dormitory at night, the person who was longest when the game crashed due to a bug was declared as the winner. No intentional time limit, just an unintended, unforseeen, inevitable in-game failure. WASD and arrow keys. Half your mass gets re-distributed into the board when you collide either into yourself or your opponent. \",\"start\":\"March 2017\"},{\"type\":\"programming\",\"name\":\"Tournament Engine for JBPL\",\"shortdescription\":\"Every year, the Junior Boys Premier League (JBPL) takes place in the Junior Boys International House (a school dormitory). Although it was a soccer tournament of much prestige, the data processing was extremely tedious. Each player had their own value metric determined by surprisingly complicated rules, and data logging during matches was nonexistent so sometimes a lot of this was wishy-washy guesswork. This engine introduces a format for logging the events that happen during each match and computes corresponding data for each player and team.\",\"description\":\"\",\"link\":\"https://github.com/nitvishn/JBPLFantasy/\",\"start\":\"November 2017\"},{\"type\":\"programming\",\"name\":\"Pascal's Triangle... but with RGB colours instead of integers?\",\"shortdescription\":\"I think the title's pretty self-explanatory. It looks cool, but I want to find more things to do with this. Any ideas? Email me.\",\"description\":\"\",\"link\":\"https://nitvishn.github.io/pascalrgb/\",\"start\":\"July 2020\"},{\"type\":\"programming\",\"name\":\"The Ultimatum Game\",\"shortdescription\":\"A terminal implementation of the Ultimatum game. Description from cs@mcgill.ca: The ultimatum game is an experimental economics game in which two parties interact anonymously and only once, so reciprocation is not an issue. The first player proposes how to divide a sum of money with the second party. If the second player rejects this division, neither gets anything. If the second accepts, the first gets her demand and the second gets the rest. I think I wrote this for the Math club while we were learning about game theory.\",\"description\":\"\",\"link\":\"https://github.com/nitvishn/ultimatumgame/\",\"start\":\"July 2020\"}]"
